In [1]:
import numpy as np 
import pandas as pd

In [2]:
pd.read_csv('http://bit.ly/uforeports',index_col=0)

                     Colors Reported Shape Reported State              Time
City
Ithaca                           NaN       TRIANGLE    NY    6/1/1930 22:00
Willingboro                      NaN          OTHER    NJ   6/30/1930 20:00
Holyoke                          NaN           OVAL    CO   2/15/1931 14:00
Abilene                          NaN           DISK    KS    6/1/1931 13:00
New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
...                              ...            ...   ...               ...
Grant Park                       NaN       TRIANGLE    IL  12/31/2000 23:00
Spirit Lake                      NaN           DISK    IA  12/31/2000 23:00
Eagle River                      NaN            NaN    WI  12/31/2000 23:45
Eagle River                      RED          LIGHT    WI  12/31/2000 23:45
Ybor                             NaN           OVAL    FL  12/31/2000 23:59

[18241 rows x 4 columns]

In [3]:
ufo = pd.read_csv('http://bit.ly/uforeports',index_col=0)

In [4]:
ufo.insert(loc=4,column='Index',value=[i for i in range(len(ufo))])

In [5]:
ufo # Inserting a column named Index at location 4th index

,Colors Reported,Shape Reported,State,Time,Index
City,,,,,
Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,0
Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,1
Holyoke,NaN,OVAL,CO,2/15/1931 14:00,2
Abilene,NaN,DISK,KS,6/1/1931 13:00,3
New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,4
...,...,...,...,...,...
Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00,18236
Spirit Lake,NaN,DISK,IA,12/31/2000 23:00,18237
Eagle River,NaN,NaN,WI,12/31/2000 23:45,18238
Eagle River,RED,LIGHT,WI,12/31/2000 23:45,18239
Ybor,NaN,OVAL,FL,12/31/2000 23:59,18240

In [12]:
user_col = ['user_id','age','gender','occupation','zip_code']
pd.read_table('http://bit.ly/movieusers',sep='|',header=None,names=user_col)

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [13]:
users = pd.read_table('http://bit.ly/movieusers',sep='|',header=None,names=user_col)

In [15]:
new_row = {'user_id':1000,'age':21,'gender':'M','occupation':'developer','zip_code':861086}
users.append(new_row,ignore_index=True) #inserting a row into the dataframe

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841
943     1000   21      M      developer   861086

[944 rows x 5 columns]

In [18]:
users.drop(columns='zip_code') # drop a particular column

     user_id  age gender     occupation
0          1   24      M     technician
1          2   53      F          other
2          3   23      M         writer
3          4   24      M     technician
4          5   33      F          other
..       ...  ...    ...            ...
938      939   26      F        student
939      940   32      M  administrator
940      941   20      M        student
941      942   48      F      librarian
942      943   22      M        student

[943 rows x 4 columns]

In [19]:
users.drop(columns=['occupation','zip_code']) #create a list to drop more than one columns

     user_id  age gender
0          1   24      M
1          2   53      F
2          3   23      M
3          4   24      M
4          5   33      F
..       ...  ...    ...
938      939   26      F
939      940   32      M
940      941   20      M
941      942   48      F
942      943   22      M

[943 rows x 3 columns]

In [20]:
users.drop(index=3) #to drop a particular row mention the index

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
4          5   33      F          other    15213
5          6   42      M      executive    98101
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[942 rows x 5 columns]

In [21]:
users.drop(index=[4,8]) #create a list to drop more than one row

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
5          6   42      M      executive    98101
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[941 rows x 5 columns]

In [22]:
users.drop(index=945)

KeyError: '[945] not found in axis'

In [23]:
users.drop(index=945,errors='ignore') #use can set errors to ignore for ignoring the error being raised

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [ ]:
#The github link for this notebook is in the description